let mytime = new Date(); //এখানে ডেট ব্রাকেটের মধ্যে কিছু না দিলে পিসির কারেন্ট ডেট এন্ড টাইম দেখাবে। আর ব্রাকেটের মধ্যে যদি কোটেশন দিয়ে কোনো ডেট বলে দেওয়া হয় তাহলে সেই ডেট টাকেই স্ট্রিং আকারে কনসোলে দেখাবে।
console.log(mytime);

//Date String
{
    const myDate = new Date("2022-03-25");
    console.log(myDate);
}

//new Date(year, month,...) 
//এটা কিন্ত Date Stringg নয়, তাই ব্রাকেটের ভেতরে কোটেশন দেওয়া যাবে না
// এখানে ব্রাকেটের ভিতর ৭ টা সংখ্যা দেওয়া যায়, এগুলা হলো যথাক্রমে বছর, মাস, দিন(তারিখ), ঘন্টা, মিনিট, সেকেন্ড, ও মিলিসেকেন্ড। এই সিরিয়াল সব সময় একই থাকবে।
// ব্রাকেটে ৭ এর বদলে ৬ টি সংখ্যা দিলে হবে যথাক্রমে বছর, মাস, দিন(তারিখ), ঘন্টা, মিনিট, সেকেন্ড।
// ব্রাকেটে ৭ এর বদলে ৫ টি সংখ্যা দিলে হবে যথাক্রমে বছর, মাস, দিন(তারিখ), ঘন্টা, মিনিট। ৪টি দিলে শেষ থেকে মিনিট বাদ যাবে, শুধু যথাক্রমে বছর, মাস, দিন(তারিখ), ঘন্টা থাকবে
{
    const myDate = new Date(2016, 9, 24, 10, 50, 6);
    console.log(myDate);
}

//জাভাস্ক্রিপ্ট মাস গননা করে 0 থেকে।
// 0 মাস = জানুয়ারি,
// 11 মাস = ডিসেম্বর।

{
    const aa = new Date('2016-02-12');
    console.log(aa.toString());
    console.log(aa.toLocaleDateString()); // এই মেথডে তারিখ।মাস/বছর এই ফরম্যাটে লোকাল ডেট দেখাবে (ঘন্টা মিনিট বাদে), শুধু ৫/৩/২০২৪ এভাবে)
    console.log(aa.toLocaleString()); // এই মেথডে তারিখ।মাস/বছর এই ফরম্যাটে লোকাল ডেট দেখাবে (ঘন্টা মিনিট সহ), ৫/৩/২০২৪, ৭ঃ ৫৭ঃ ৪০ pm এভাবে
    console.log(aa.toLocaleTimeString()); // এই মেথডে শুধু টাইম দেখাবে
    console.log(aa.toString());
}

//************************ Date Get Methods **************************/
// .getFullYear() method
{
    const a = new Date("2023-02-20"); //এখানে ব্রাকেটের ভেতর কিছুনা লিখলে নিচের সব মেথডের কনসোলে আজকের ডেট টাইম  ইত্যাদি দেখাবে ***
    a.getFullYear(); // এই মেথডে ৪ ডিজিটে বছর দেখাবে (যেমন 2022)
    console.log(a.getFullYear());
    console.log(a.getMonth()); //শুধু মাস দেখাবে, তবে যে মাস হওয়ার কথা তারচেয়ে ১ মাস কম দেখাবে (কারন ০ থেকে মাস গননা করে জাভাস্ক্রিপ্ট।) এপ্রিল মাস ৪ হওয়ার কথা, কিন্ত দেখাবে ৩
    console.log(a.getDate()); //তারিখ দেখাবে, তারিখ কিন্রত ০ থেকে কাউন্ট হয়না, ১ থেকেই কাউন্ট হয়
    console.log(a.getMilliseconds()); //মিলি সেকেন্ড দেখাবে
    console.log(a.getTime()); //মিলি সেকেন্ড দেখাবে (new Date ব্রাকেটে স্ট্রিং এ কোন ভ্যালু না দিলে ১৯৭০ থেকে বর্তমান সময় পর্যন্ত মিলি সেকেন্ডে দেখাবে )
}

{
    const months = ["January", "February", "March", "April", "May", "June", "July", "August", "September", "October", "November", "December"];

    const a = new Date("2021-02-16");
    let monthNow = months[a.getMonth()];
    console.log(monthNow);
}

//********************* JavaScript Date Set Methods ********************* */
{
    let a = new Date();
    console.log(a.setFullYear(2022));
    console.log(a.setDate(20));
}