{
  const pi = Math.PI;
  console.log(pi);
  console.log(Number(pi.toFixed(3)));
}

//*** বৃত্তের ক্ষেত্রফল বের করার নিয়ম ***/
//Area of Circle
// A = PI * r**2 //এটা হলো বৃত্তের ক্ষেত্রফল বের করার সুত্র, এখানে r**2 মানে r স্কয়ার
{
  const r = 3;
  const A = Number(Math.PI * r ** 2).toFixed(3);
  console.log(`This is the area of circle: ${A}`);
}

// বর্গমূল বা Square root বের করার নিয়ম
{
  const a = Math.sqrt(64); //Math.sqrt() এই মেথড দিয়ে বর্গমূল বের করা হয়, যে সংখ্যার বর্গমূল বের করতে হবে তাকে .sqrt এর ডানের ব্রাকেটে লিখতে হবে। ৬৪ এর বর্গ মূল ৮ (৮*৮=৬৪), তাই কনসোলে ৮ প্রিন্ট হবে
  console.log(a);
}

//******************** Math Methods ********************/

//Number to Integer ***
//একটা নাম্বারকে রাউন্ড করে একটা ইন্টেজারে (পূর্ন সংখ্যা) পরিনত করার জন্য প্রধানত ৪ ধরনের মেথড রয়েছে।

// Math.round() method
{
  const a = Math.round(2.4); //এই মেথডে দশমিক সংখ্যাকে তার সবচেয়ে নিকটবর্তী পূর্ন সংখ্যায় রুপান্তর করে, 2.4 এর সবচেয়ে কাছের পূর্ন সংখ্যা হলো ২, তাই কনসোলে ২ আসবে। কিন্ত ২ এরপর দশমিকের পর যদি ৫ বা তার বেশি যেমন ৬,৭ ইত্যাদি থাকে তাহলে সেটাকে রাউন্ড করে ৩ বানিয়ে ফেলবে।
  console.log(a);
}

// Math.ceil() method
{
  const a = Math.ceil(2.4); //এই মেথডে দশমিক সংখ্যাকে তার উপরের সবচেয়ে নিকটবর্তী পূর্ন সংখ্যায় রুপান্তর করে, 2.4 এর উপরের দিকের সবচেয়ে কাছের পূর্ন সংখ্যা হলো ৩, তাই কনসোলে ৩ আসবে।  ২ এরপর দশমিকের পর ১,২,৬,৭ যাই থাকুক না কেন সেটাকে একধাপ উপরে তুলে রাউন্ড করে ৩ বানিয়ে ফেলবে।
  console.log(a);
}

// Math.floor() method
{
  const a = Math.floor(2.9); //এই মেথডে দশমিক সংখ্যাকে তার নিচের দিকে সবচেয়ে নিকটবর্তী পূর্ন সংখ্যায় রুপান্তর করে, 2.9 এর নিচের দিকের সবচেয়ে কাছের পূর্ন সংখ্যা হলো 2, তাই কনসোলে 2 আসবে।  ২ এরপর দশমিকের পর ১,২,৬,৭ যাই থাকুক না কেন সেটাকে একধাপ নিচে নিয়ে রাউন্ড করে ২ বানিয়ে ফেলবে।
  console.log(a);
}

// Math.trunc() method
{
  const a = Math.trunc(2.9); // এই মেথডে ২.৯ এর দশমিক অংশ টুকু বাদ দিয়ে শুধু ২ রাখবে, যেকোনো সংখ্যার দশমিকের পরের অংশ টিকে বাদ দিয়ে শুধু ইন্টেজার(পূর্ন সংখ্যা) অংশটুকুকেই কনসোলে দেখাবে।
  console.log(a);
}

// Math.sign() method
{
  const a = Math.sign(20); // কোনো সংখ্যা পজেটিভ নাকি নেগেটিভ সেটা বের করার জন্য এই মেথড ইউজ করা হয়। ব্রাকেটে যদি মাইনাস ফিগারসহ কোনো সংখ্যা (যেমন -২০) থাকে তবে কনসোলে -1 রিটার্ন করবে। ব্রাকেটে যেকোনো পজেটিভ সংখ্যা (মাইনাস ছাড়া) থাকলে শুধু 1 রিটার্ন করবে।
  console.log(a);
}

// Math.pow() method
// Math.pow(x,y) কোনো সংখ্যাকে বর্গ করতে চাইলে বা তার উপরে পাওয়ার দিতে চাইলে (যেমন 5 স্কয়ার, ৭ স্কয়ার, ইত্যাদি) এই মেথড ব্যবহার করা হয়। এখানে .pow এর ব্র্যাকেটে (x,y) এর মধ্যে x হলো মূল সংখ্যাটি, এবং y হলো x এর উপরে পাওয়ার। অর্থাৎ x =5 এবং y = 2 হলে এটার ধরন হবে 5 স্কয়ার। একই কাজ এক্সপোনেনশিয়াল এর সাহায্যেও করা যায় (যেমন 5**2, এখানে 5 এর পাওয়ার হলো 2)
{
  const a = Math.pow(5,2); // কনসোলে ২৫ রিটার্ন করবে
  console.log(a);
}

// Math.abs() method
// abs মানে বুঝায় absolute, এটা ব্রাকেটের ভেতরে থাকা x বা y এর মান যদি নেগেটিভ হয় তাহলে সেটাকে পজেটিভ আকারে রিটার্ন করে। অর্থাৎ নেগেটিভ ভ্যালুকে পজেটিভ ভ্যালুতে কনভার্ট করার জন্য এই মেথড ব্যবহার হয়
{
  const a = Math.abs(-15);
  console.log(a);
}

// Math.min() method ***very important
{
  const a = Math.min(1,20,-105,-250,-63,36,58,42); // ব্রাকেটের মধ্যে যে আর্গুমেন্টগুলো দেওয়া আছে তাদের মধ্যে সবচেয়ে মিনিমাম(লোয়েস্ট) ভ্যালু বের করার জন্য Math.min() মেথড ব্যবহার হয়।
  console.log(a);
}

// Math.max() method ***very important
{
  const a = Math.max(1,20,-105,-250,-63,36,58,42); // ব্রাকেটের মধ্যে যে আর্গুমেন্টগুলো দেওয়া আছে তাদের মধ্যে সবচেয়ে ম্যাক্সিমাম(হাইয়েস্ট) ভ্যালু বের করার জন্য Math.max() মেথড ব্যবহার হয়।
  console.log(a);
}



//********************* JS Random ***********************/

// Math.random() ***very very important
// এই মেথড প্রতিবার কনসোল করলে একেকটা Random নাম্বার রিটার্ন করে। 0 থেকে 1 এর মধ্যে যেকোনো সংখ্যা সে রিটার্ন করে (যেমন, 0.2, 0.6, 0.9 ইত্যাদি)
{
  const a = Math.random(); // এটাকে প্রতিবার কনসোল করলে আলাদা আলাদা র‍্যান্ডম নাম্বার রিটার্ন করবে ০ হতে ১ এর মধ্যে (অর্থাৎ বেশিরভাগ সময়ই দশমিক সংখ্যা রিটার্ন করবে)
  console.log(a);
  console.log(Math.round(a)); //Math.random কে রাউন্ড ফিগার বানানোর নিয়ম এটা। a ভ্যারিয়েবলের মধ্যে Math.random কে রাখা হয়েছিল, এবার a কে Math.round এর ব্র্যাকেটে রাখলেই রাউন্ড ফিগার করে কখনো ০ আবার কখনও ১ রিটার্ন করবে কনসোলে।
}

{
  const s = Math.floor(Math.random()*10); //এখানে Math.random কে ১০ দিয়ে গুন করার ফলে এটা দশমিকের আগে এক ঘর বাড়বে (যেমন .2156489 এমন সংখ্যা থেকে 2.33658 এমন হয়ে যাবে। সেটাকে Math.floor করে রাউন্ড করা হয়েছে)
  console.log(s);
}

// https://www.w3schools.com/js/js_random.asp এই লিংকের শেষ দিকে JS random এর কিছু গুরুত্বপূর্ন সুত্র দেওয়া আছে ***