const substraction = (a, b) => {
    return a - b;
};

const result = substraction();
console.log(result);

//প্রথমেই subtraction নামে একটা ফাংশন লিখলাম (অ্যারো ফাংশন)

// আমরা জানি ফাংশন লিখলে প্যারেন্থিসিস ব্রাকেটে () ফাংশনের প্যারামিটার দিতে হয়, যেমন (x,y,z)

// আমরা জানি, এই ফাংশনকে যখন কল করতে হবে তখন substraction() লিখে এর ব্রাকেটে আর্গুমেন্ট দিতে হতে যত গুলো প্যারামিটার আছে ততগুলা, এই আর্গুমেন্ট গুলাই প্যারামিটারের ভ্যালু হিসেবে কাজ করে।

//কিন্ত কোন কারনে যদি ফাংশন কল করার সময় substraction() এর ব্রাকেটে আর্গুমেন্ট বা ভ্যালু দিতে ভুলে যাই (৫ নং লাইনের মত) তাহলে কনসোল করলে NaN আসবে। ৫ নং লাইনে লক্ষ করলে দেখা যাবে substraction() এর ব্র্যাকেটে আমি কোনো ভ্যালু দেইনাই, ফলে প্যারামিটার গুলা (a,b) কোনো ভ্যালু খুজে পাচ্ছেনা। ফলে NaN আসবে কনসোলে


//উপরোক্ত এই সমস্যা সমাধানের জন্য এসেছে ডিফল্ট প্যারামিটার  ********* ***** ******* *******

// ডিফল্ট প্যারামিটার মানে ফাংশনটা লেখার সময়ই const substraction = (a, b) => যখন লিখব তখনই a ও b প্যারামিটারের মধ্যে ভ্যালু এসাইন করে দেওয়া যায় (a = 10, b = 5) এভাবে। এরফলে এই ভ্যালু গুলা প্যারামিটারের ডিফলত ভ্যাল হিসেবে কাজ করবে, পরে ফাংশন কল করার সময় যদি আর্গুমেন্ট/ভ্যালু দিতে ভুলেও যাই এই ফাংশনটা তখন এই ডিফল্ট ভ্যালু (a = 10, b = 5) নিয়ে কাজ চালিয়ে ফেলবে।

//উদাহরনঃ
{
    const substraction = (a = 10, b = 5) => {  //এখানে ফাংশনের প্যারামিটার লেখার সময়ই (a,b) এর ভ্যালু এসাইন করে দিলাম (a = 10, b = 5), এটাই হচ্ছে ডিফল্ট প্যারামিটার
        return a - b;
    };

    const result = substraction(); //এখানে ফাংশন কল করার সময় substraction ব্রাকেটে কোনো ভ্যালু/আর্গুমেন্ট দেই নাই, তাই ফাংশনটা ডিফল্ট ভ্যালু (a = 10, b = 5) নিয়ে কাজ করেছে, যদি এখানে ব্র্যাকেটে আর্গুমেন্ট দিতাম তাহলে ডিফল্ট ভ্যালু গুলাকে ওভাররাইট করে এখানে দেওয়া ভ্যালু গুলোকে নিয়ে ফাংশন কাজ করতো।

    console.log(result);
}

// অর্থাৎ ফাংশনের প্যারামিটার প্যারেন্থিসিস ব্রাকেট (a,b) লেখা সময় যদি প্যারামিটারের ভ্যালুও লিখে দেওয়া হয় (যেমন (a = 10, b = 5)) তাকেই ডিফিল্ট প্যারামিটার বলে।