//***************** Function Expresssion *****************/

// কোনো ফাংশনকে যদি কোনো ভ্যারিয়েবলের মধ্যে স্টোর করে রাখা হয় তাহলে তাকে বলা হয় Function Expresssion.

//Example
const sum = function(a,b,c){
    return a+b+c;
}
console.log(sum(4,5,7));

// প্রথমেই const দিয়ে sum নামের একটা variable ডিক্লেয়ার করলাম, এরপর function কীওয়ার্ড দিয়ে একটা ফাংশন লিখে এটাকে sum এর মধ্যে স্টোর করলাম

// আমরা জানি, function কীওয়ার্ড লেখার পর ফাংশনের নাম লিখতে হয়, কিন্ত এখানে ফাংশনের কোনো নাম লিখতে হবেনা, কারন ফাংশনটাকে যে sum নামক ভ্যারিয়েবলে রাখা হয়েছে ওই sum নামটাই এই ফাংশনের নাম হিসেবে গন্য হবে।

// function কীওয়ার্ড লেখার পর ফাংশনের নাম না লিখে সরাসরি ব্রাকেট () দিয়ে তার ভেতর প্যারামিটার দিতে হবে, আমি ৩টা প্যারামিটার দিলাম (a,b,c)

// এরপর কার্লিব্রেস {} দিয়ে code block to be executed দিতে হবে, আমি দিলাম return a+b+c, অর্থাৎ a b ও c প্যারামিটারের ভ্যালুগুলাকে যোগ করে রিটার্ন করো। রিটার্ন হবে ফাংশনের মাধ্যমে sum ভ্যারিয়েবলের ভেতর।

// এই ফাংশনকে কল করতে হলে sum দিয়ে কল করতে হবে যেহেতু এখনেই ফাংশনের নাম হয়ে গেসে sum

// এই ফাংশনকে কল করার জন্য console.log(sum(4,5,7)); এভাবে লিখতে হবে, কনসোলের ব্র্যাকেটের ভেতর sum লিখে আবার ব্রাকেট দিয়ে তার ভেতরে ৩টা আর্গুমেন্ট দিলাম (4,5,7), এই আর্গুমেন্ট গুলাই ফাংশনের (a,b,c) প্যারামিটারের ভ্যালু হিসেবে কাজ করবে

// এই ফাংশনের কোনো নাম না দেওয়ার কারনে একে anonymous ফাংশনও বলা হয়।