x = 25;
console.log(x);
var x;

//উপরের কোডটা তে দেখা যাচ্ছে x ভ্যারিয়েবলটা আমি ডিক্লেয়ার করিনি, ডিক্লেয়ার না করেই তাতে একটা ভ্যালু (25) এসাইন করে দিয়েছি। এরপর সেটাকে কন্সোলও করে দিয়েছি।

// এরপর কনসোল করার পরে গিয়ে আমি ভ্যারিয়েবলটাকে ডিক্লেয়ার করেছি var x

//নরমালি এটা ইরর আমার কথা ছিল কারন আমি ভ্যারিয়েবল ডিক্লেয়ার না করেই তাতে ভ্যালু এসাইন করে দিয়েছি। কিন্ত ইরর আসবে না।

//কারন জাভাস্ক্রিপ্ট নিজে থেকেই ৩ নাম্বার লাইনে যেখানে আমরা ভ্যারিয়েবল var x ডিক্ল্যেয়ার করেছি সেটাকে ঠেলে সবার উপরে তুলে দিয়েছ, ফলে var x টা x=25 এর উপরে উঠে গেসে, তাই এই কোড ইরর হয়নাই।

//এইযে জাভাস্ক্রিপ্ট var x কে সবার উপরে তুলে দিল এটাকেই বলা হয় Hoisting

// Hoisting বা ডিক্লারেশন গুলোকে scope এর একদম উপরে তুলে দেওয়া জাভাস্ক্রিপ্টের একটা ডিফল্ট বিহেভিয়ার। গ্লোবাল বা ব্লক বা ফাংশন scope এর যেখানেই কনো ভ্যারিয়েবল ডিক্লেয়ার করা হোক না কেন জাভাস্ক্রিপ্ট সেই ভ্যারিয়েবলে গুলোকে নিজ নিজে স্কোপের একদম উপরে উলে দিবে। ডিক্লারেশন গুলো বলতে ভ্যারিয়েবল ডিক্লারেশন বোঝানো হয়েছে।

//** নোটঃ জাভাস্ক্রিপ্টে var দিয়ে কোন ভ্যারিয়েবলকে ডিক্লেয়ার করার আগেই সেটাকে ইউজ করা যায় (উপরের এক্সামপলের মত)

//** নোট-২ঃ let ভ্যারিয়েবলকে যদি ডিক্লেয়ার করার আগেই ইউজ করা হয়য় তাহলে referenceError আসবে, তাই let দিয়ে কাজ করলে let ভ্যারিয়েবলকে আগেই ডিক্লেয়ার করে নিতে হবে

// let এবং const দিয়ে ভ্যারিয়েবল ডিক্লেয়ার করলেও সেগুলো Hoisted হয় কিন্ত সেই ভ্যারিয়েবলগুল আগেই ডিক্লেয়ার করে নিতে হয় নাহলে ইউজ করা যায়না, যেমন:

let x; //এখানে let x কে সবার উপরে আগেই ডিক্লেয়ার করে নিতে হবে, ডিক্লেয়ার করার আগে পর্যন্ত ইউজ করা যাবেনা ( মানে let x যদি x = 10 এর নিচে লেখা হয় তাহলে ইরর আসবে), const ও তাই
x=10;
console.log(x);

// const দিয়ে ভ্যারিয়েবল ডিক্লেয়ার করলে সাথে সাথেই তাতে ভ্যালু এসাইন করে দিতে হবে, ভ্যালু না দিয়ে শুধু ডিক্লেয়ার করে রাখা যাবে না, যেমন const x = 10, এখানেই একই সাথে ডিক্লেয়ার ও ভ্যালু এসাইন করে দিলাম, শুধু const x লিখে রাখলে ইরর আসবে।



// গুরুত্বপূর্ন নোটঃ জাভাস্ক্রিপ্ট শুধু ডিক্লারেশন গুলোকে Hoisted (উপরে তোলা) করে, initialization গুলোকে Hoisted করেনা। 

// ডিক্লারেশন হলো ভ্যারিয়েবল অথবা ফাংশন ডিক্লেয়ার করা যেমন var x;
// initialization হলো ডিক্লেয়ার করা ভ্যারিয়েবলে ভ্যালু এসাইন করা যেমন x = 10;



