"use strict" //যেকোনো ফাংশন বা ব্লক scope এর একদম উপরে/শুরুতে "use strict" লিখে দিলে সেই কোড ব্লক টা strict মোডে রান হবে। শুধু যেই কোড ব্লকে "use strict" লেখা হবে সেই কোড ব্লকটাই strict মোডে রান হবে, বাকি কোড ব্লক/স্কোপ গুলো নরমাল থাকবে/

//কোনো ফাংশনের ভেতর strict mode ইউজ করলে শুধু সেই ফাংশনটাই strict মোডে রান করবে

// Strict মোডে ভ্যারিয়েবল ডিক্লেয়ার করার আগে সেই ভ্যারিয়েবল ইউজ করা যায়না। ভ্যারিয়েবল ডিক্লেয়ার না করলে সেই ভ্যারিয়েবলকে কনসোল করলে রেফারেন্স ইরর আসবে।

// *** "use strict" লিখলে অবশ্যই সেটা কোনো ফাংশন বা কোড ব্লকের একদম শুরুতে লিখতে হবে