// Spread operator মূলত অবজেক্ট বা অ্যারে কপি করার কাজে ব্যাবহুত হয়।  immutability vs mutability চ্যাপ্টারে আমরা দেখেছি Reference Data Type (Object, Array, etc) এর ক্ষেত্রে একটা user নামক অবজেক্টকে person নামক ভ্যারিয়েবলে রাখার পর person এর কোনো ভ্যালু চেঞ্জ করলে user নামক অবজেক্টের ভ্যালুও চেঞ্জ হয়ে যাচ্ছে। অর্থাৎ Reference/Object Data Type হলো mutable (পরিবর্তনীয়)।

//এই সমস্যা সমাধান করা যায় spread অপারেটর ব্যাবহার করে, spread ব্যাবহার করলে user অব্জেক্টকে person নামক ভ্যারিয়েবলে সরাসরি না রেখে user অব্জেক্টকে ক্লোন/কপি করে person এর ভেতর রাখা হয়। ফলে person এর কোনো ভ্যালু চেঞ্জ করলে user নামক অবজেক্টের ভ্যালু চেঞ্জ হয়না। তিনটা ডট (...) দিয়ে spread অপারেটর লেখা হয়।

const user = {
    userName: "Omar",
    passWord: 1243
} //এখানে আমরা একটা অবজেক্ট তৈরী করলাম user নামে

console.log(user);

const person = {...user}; // এখানে person ভ্যারিয়েবলের ভেতর প্রথমে একটা empty অবজেক্ট নিলাম {} দিয়ে, এরপর {} ভেতর ৩টা ডট দিয়ে যেই অজেক্টকে কপি করতে চাই তার নাম লিখব, আমি user অব্জেক্টকে কপি করব তাই user লিখলাম। ৩টা ডট দিয়ে অ্যারের নাম লেখার এই পদ্ধিতিই হলো spread অপারেটর।

// এখানে আমরা মূল user অবজেক্টকে person ভ্যারিয়েবলে রাখি নাই, user কে ক্লোন/কপি করে এনে person ভ্যারিয়েবলে রেখেছি

console.log(person);

person.passWord = 2256; // এবার আমরা person.passWord দিয়ে person এর নতুন পাসওয়ার্ড এসাইন করলাম
person.age = 30; //person.age দিয়ে person এর ভেতর age নামে একটা প্রপার্টি যুক্ত করলাম।

console.log(person);

console.log(user); //person অবজেক্টের password ভ্যালু পরিবর্তন ও age যুক্ত করার পরেও এখন user কে কনসোল করলে দেখা যাবে user এর মূল ভ্যালু গুলা পরিবর্তন হয়নাই,অর্থাত person অবজেক্ট user অবজেক্টের মূল ভ্যালুকে পরিবর্তন করতে পারে নাই, কারন spread অপারেটর দিয়ে user অবজেক্টের একটা কপিকেই আমরা person এর মধ্যে এনেছি। মূল user অবজেক্ট অক্ষত আছে। 

// একটা অবজেক্টকে কপি/ক্লোন করে আরেকটা অবজেক্টের মধ্যে আনার জন্যই spread অপারেটর ইউজ করা হয়।


//***** অ্যারের ক্ষেত্রে Spread অপারেটরের ব্যবহার */
const q1 = ["Jan", "Feb", "Mar"];
const q2 = ["Apr", "May", "Jun"];
const q3 = ["Jul", "Aug", "Sep"];
const q4 = ["Oct", "Nov", "Dec"];
//এখানে ৪টা অ্যারে নিলাম q1, q2, q3, q4 নামে

const year = [...q1, ...q2, ...q3, ...q4]; //এবার spread অপারেটরের সাহায্যে একটা empty array এর মধ্যে ৩টা ডট দিয়ে প্রতিটা অ্যারে অবজেক্টের নাম লিখতে হবে, প্রতিটা অবজেক্ট নামের পর কমা দিতে হবে।

//এবার year কে কনসোল করলে দেখা যাবে q1, q2, q3, q4 একত্র হয়ে একটা সিঙ্গেল অ্যারেতে পরিনত হয়েছে

console.log(year);

//কিন্ত  q1, q2, q3, q4 এদের আলাদা ভাবে কনসোল করলে দেখা যাবে তাদের মধ্যে কোনো পরিবর্তন হয়নাই, কারন Spread অপারেটর ব্যবহার করে তাদের (q1, q2, q3, q4) কপি/ক্লোন কে year অবজেক্টে এনেছিলাম।